<a href="https://colab.research.google.com/github/AnhVietPham/Machine-Learning/blob/main/Panda_research.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [84]:
import pandas as pd
import numpy as np

# **3**. **Khởi tạo và truy cập với dữ liệu kiểu series trong pandas**

---

In [85]:
S = pd.Series(np.random.randint(100, size = 5))
S

0    18
1    10
2    78
3    16
4    15
dtype: int64

In [86]:
print(S.index)
print(S.values)

RangeIndex(start=0, stop=5, step=1)
[18 10 78 16 15]

So sánh với ndarray trong numpy thì chỉ mục của nó chỉ là các con số khô khan, trong khi đó với Series thì chúng ta hoàn toàn có thể gán bất cứ Object nào

In [87]:
phones = ['Iphone',"Samsung Note","Samsung S","Nokia"]
quantites = [10,20,30,1000]
S = pd.Series(quantites, index = phones)
S

Iphone            10
Samsung Note      20
Samsung S         30
Nokia           1000
dtype: int64

# **Cộng/Trừ hai đối tượng**

In [88]:
phones = ['Iphone',"Samsung Note","Samsung S","Nokia"]

In [89]:
quantities = [10,12,30,100]
S1 = pd.Series(quantites, index = phones)
S2 = pd.Series([32,14,15,16], index=phones)

In [90]:
S1 + S2

Iphone            42
Samsung Note      34
Samsung S         45
Nokia           1016
dtype: int64

In [91]:
phones2 = ['LG',"Samsung Note","Samsung S","Nokia"]
S3 = pd.Series([32,14,15,16], index=phones2)

In [92]:
S2 + S3

Iphone           NaN
LG               NaN
Nokia           32.0
Samsung Note    28.0
Samsung S       30.0
dtype: float64

# **Khởi tạo từ một dictionary**

In [93]:
phones = ['Iphone',"Samsung Note","Samsung S","Nokia"]
quantities = [10,12,30,100]
dic = dict(zip(phones, quantites))
dic

{'Iphone': 10, 'Nokia': 1000, 'Samsung Note': 20, 'Samsung S': 30}

In [94]:
S4 = pd.Series(dic)
S4

Iphone            10
Samsung Note      20
Samsung S         30
Nokia           1000
dtype: int64

# **4. Thao tác toán học và Các hàm cơ bản (pandas series)**

In [95]:
phones = ['Iphone',"Samsung Note","Samsung S","Nokia"]
quantities = [10,12,30,100]
sales = dict(zip(phones, quantites))
S4 = pd.Series(sales)
S4

Iphone            10
Samsung Note      20
Samsung S         30
Nokia           1000
dtype: int64

Thao tác toán học

In [96]:
S4**2

Iphone              100
Samsung Note        400
Samsung S           900
Nokia           1000000
dtype: int64

In [97]:
S4 * 2

Iphone            20
Samsung Note      40
Samsung S         60
Nokia           2000
dtype: int64

In [98]:
S4 + 11

Iphone            21
Samsung Note      31
Samsung S         41
Nokia           1011
dtype: int64

Các hàm cơ bản trong pandas series.

In [99]:
S4.axes

[Index(['Iphone', 'Samsung Note', 'Samsung S', 'Nokia'], dtype='object')]

trả về chiều của dữ liệu , theo định nghĩa nó là 1

In [100]:
S4.ndim

1

trả về số lượng phần tử có trong dữ liệu series đó

In [101]:
S4.size

4

trả về danh sách phần tử của dữ liệu kiểu theo kiểu ndarray

In [102]:
S4.values

array([  10,   20,   30, 1000])

# **5. Giới thiệu dataframe**


> Ý tưởng cơ bản của một dataframe dựa trên bảng tính. Chúng ta có thể thấy cấu trúc dữ liệu của một dataframe như dạng bảng và bảng tính. Nó chứa một bộ các cột. Mỗi cột bao gồm một loại dữ liệu duy nhất, nhưng các cột khác nhau có thể có các loại khác nhau, ví dụ: Cột đầu tiên có thể bao gồm số nguyên, trong khi cột thứ hai bao gồm các giá trị boolean etc.\n

pandas cung cấp cho ta phương thức pandas.DataFrame( data, index, columns, dtype, copy) để tạo ra một dataframe từ nhiều cấu trúc dữ liệu khác nhau một cách linh hoạt.

Trong đó:

     ‘data’ sẽ nhận giá trị từ nhiều kiểu khác nhau như ndarray, series, map, lists, dict, constants and also another DataFrame.

     ‘index’ là nhãn chỉ mục hàng của dataframe.

     ‘columns’ nhãn chỉ mục cột của dataframe.

     ‘dtype’ là kiểu dữ liệu cho mỗi cột. 

     ‘copy’ nhận giá trị True/False để chỉ rõ dữ liệu có được copy sang vùng nhớ mới không, mặc định sẽ nhận giá trị False.

In [103]:
crimes_rates = {'year': [1960,1961,1962,1963,1964], 'Population': [179323175,182992000,185771000,188483000,191141000],"Total":[3384200,3488000,3752200,4109500,4564600],"Violent":[288460,289390,301510,316970,364220]}
ordinals = ["first","second","third","fourth","fifth"]

In [104]:
crimes_dataframe = pd.DataFrame(crimes_rates, index = ordinals)

In [105]:
crimes_dataframe

        year  Population    Total  Violent
first   1960   179323175  3384200   288460
second  1961   182992000  3488000   289390
third   1962   185771000  3752200   301510
fourth  1963   188483000  4109500   316970
fifth   1964   191141000  4564600   364220

In [106]:
crimes_dataframe = pd.DataFrame(crimes_rates, columns=["Violent", "Population", "Total"], index = crimes_rates["year"])
crimes_dataframe

      Violent  Population    Total
1960   288460   179323175  3384200
1961   289390   182992000  3488000
1962   301510   185771000  3752200
1963   316970   188483000  4109500
1964   364220   191141000  4564600

In [107]:
print(crimes_dataframe["Violent"])

1960    288460
1961    289390
1962    301510
1963    316970
1964    364220
Name: Violent, dtype: int64

In [108]:
vio2 = pd.Series([12, 34, 56, 23, 45], index = crimes_dataframe.index)
crimes_dataframe["Violent"] = vio2
crimes_dataframe

      Violent  Population    Total
1960       12   179323175  3384200
1961       34   182992000  3488000
1962       56   185771000  3752200
1963       23   188483000  4109500
1964       45   191141000  4564600

In [109]:
crimes_dataframe["Murder"] = np.nan
crimes_dataframe

      Violent  Population    Total  Murder
1960       12   179323175  3384200     NaN
1961       34   182992000  3488000     NaN
1962       56   185771000  3752200     NaN
1963       23   188483000  4109500     NaN
1964       45   191141000  4564600     NaN

In [110]:
crimes_dataframe["Murder"] = 9110
crimes_dataframe

      Violent  Population    Total  Murder
1960       12   179323175  3384200    9110
1961       34   182992000  3488000    9110
1962       56   185771000  3752200    9110
1963       23   188483000  4109500    9110
1964       45   191141000  4564600    9110

# **7.Giới thiệu Panel**

> Panel được sử dụng không nhiều, nhưng vẫn quan trọng đối với dữ liệu 3 chiều. Các panel data được lấy từ kinh tế lượng và chịu trách nhiệm một phần về cái tên pandas: pan(el)-da(ta)-s. 
Tên của 3 trục này nhằm tạo ra một số ý nghĩa ngữ nghĩa để mô tả các hoạt động liên quan đến panel data, và đặc biệt là phân tích các bảng dữ liệu kinh tế lượng. Tên của 3 trục được dùng để đưa ra một số ý nghĩa ngữ nghĩa để mô tả các hoạt động liên quan đến panel data. chúng là –

Items – trục 0, mỗi item tương ứng với một dataframe chứa bên trong.

major_axis - trục 1, đó là chỉ mục (hàng) của mỗi dataframe.

minor_axis - trục 2, đó là các cột của mỗi dataframe.

Pandas cung cấp phương thức pandas.Panel(data, items, major_axis, minor_axis, dtype, copy) để có thể tạo được Panel từ nhiều kiểu dữ liệu khác nhau như tạo một dataframe.
Trong đó:

      ‘data’ có thể nhận các kiểu dữ liệu sau: ndarray, series, map, lists, dict, hằng số và cả dataframe khác.

      ‘items’ là axis = 0.

      ‘major_axis’ là axis = 1.

      ‘minor_axis’ là axis = 2.

      ‘dtype’ là kiểu dữ liệu mỗi cột.

      ‘copy’ nhận giá trị True/False để khởi tạo dữ liệu có chia sẻ memory hay không

# **8. .loc, .iloc, .ix**

.iloc giúp selecting hàng và cột qua các row và column numbers. Cú pháp **data.iloc[row selection, column selection]**. Những input được phép truyền vào là một số nguyên (5), một list của các số nguyên ([1,2,3]), một slice object với các số nguyên (1:5), một boolean array hay một callable function.

In [111]:
print('Select row having row number is 1')
crimes_dataframe.iloc[1]

Select row having row number is 1

Violent              34
Population    182992000
Total           3488000
Murder             9110
Name: 1961, dtype: int64

In [112]:
print('Select data of Violent when index of row is 3')
crimes_dataframe.iloc[3,3]

Select data of Violent when index of row is 3

9110

# .**loc**  giúp selecting hàng và cột qua hai cách: Cách 1 qua các row và column index hoặc nhãn. Cách 2 qua boolean/conditional lookup. Cú pháp là **data.loc[row selection, column selection]**.

In [113]:
ordinals = ["first", "second", "third", "fourth","fifth",]
crimes_dataframe = pd.DataFrame(crimes_rates, index=ordinals)

In [114]:
crimes_dataframe

        year  Population    Total  Violent
first   1960   179323175  3384200   288460
second  1961   182992000  3488000   289390
third   1962   185771000  3752200   301510
fourth  1963   188483000  4109500   316970
fifth   1964   191141000  4564600   364220

# Sử dụng .**loc** với các nhãn đã được định nghĩa

In [115]:
crimes_dataframe.loc['first']

year               1960
Population    179323175
Total           3384200
Violent          288460
Name: first, dtype: int64

# Với .**loc** ta có thể truyền vào boolean/conditional lookup (Boolean filter vector). Bằng cách đó ta có thể lọc được các hàng thỏa mãn điều kiện nào đó.

In [119]:
crimes_dataframe.loc[crimes_dataframe.year > 1961]

        year  Population    Total  Violent
third   1962   185771000  3752200   301510
fourth  1963   188483000  4109500   316970
fifth   1964   191141000  4564600   364220

# **Slicing arrays**

Slicing in python means taking elements from one given index to another given index.

We pass slice instead of index like this: [start:end].

We can also define the step, like this: [start:end:step].

If we don't pass start its considered 0

If we don't pass end its considered length of array in that dimension

If we don't pass step its considered 1

# **Note: The result includes the start index, but excludes the end index.**

In [129]:
crimes_dataframe.iloc[[0,1],0:2]

        year  Population
first   1960   179323175
second  1961   182992000

# **9. Đọc dữ liệu và kĩ thuật reindexing**


> Đọc dữ liệu

Pandas cung cấp một số công cụ giúp đọc một số định dạng dữ liệu phổ biến và trả về một dataframe. Đọc định dạng *csv ta dùng pd.read_csv(), đọc định dạng excel ta dùng pd.read_excel(), đọc định dạng html ta dùng pd.read_html(), đọc định dạng json ta sử dụng pd.read_json(). Trong bài này tôi sẽ đi sâu vào phần đọc dữ liệu từ định dạng *csv. Hàm pd.read_csv() có rất nhiều đối số giúp chúng ta tùy biến đọc dữ liệu, trong đó tôi thấy cần chú ý một số các đối số sau:

+ filepath_or_buffer: chính là đường dẫn của file, đường dẫn này cũng chấp nhận cả dạng URL.

+ sep: để chỉ định các giá trị trong file được phân biệt qua kí tự nào ví dụ như: ‘,’ hoặc ‘space’, ‘t’. Giá trị mặc định là ‘,’.

+ header: để chỉ rõ dataframe sẽ nhận hàng nào làm tên của cột. và dữ liệu sẽ bắt đầu được tải lên từ sau dòng đấy.

+ index_col: tham số rất hữu ích để chọn một cột làm index.

+ parse_dates:

Nhận giá trị True/False để. Nếu là True sẽ cố gắng chuyển index theo định nghĩa của tham số date_parser về dạng datatime.

List: ví dụ [1,2,3] sẽ cố gắng chuyển cột 1,2,3 theo định nghĩa của tham số date_parser về dạng datatime.

List của list: ví dụ [[1,2,3]] chúng sẽ kết hợp cột 1,2,3 để có thể chuyển thành cột duy nhất có dạng datatime theo định nghĩa date_parser.

+ chunksize: khi bộ nhớ máy tính không đủ để load một lần thì giải pháp đọc từng phần thành một lựa chọn thích hợp vì vậy tham số chunksize sẽ là một giải pháp cho việc này. Ví dụ giải pháp sử dụng  tại https://stackoverflow.com/questions/25962114/how-to-read-a-6-gb-csv-file-with-pandas

In [130]:
from google.colab import files
uploaded = files.upload()
df_breast_cancer = pd.read_csv('data.csv')

Saving data.csv to data.csv

In [132]:
df_breast_cancer.head()

         id diagnosis  ...  fractal_dimension_worst  Unnamed: 32
0    842302         M  ...                  0.11890          NaN
1    842517         M  ...                  0.08902          NaN
2  84300903         M  ...                  0.08758          NaN
3  84348301         M  ...                  0.17300          NaN
4  84358402         M  ...                  0.07678          NaN

[5 rows x 33 columns]

#**bold text** 10. Lọc dữ liệu trong pandas

> Các kĩ thuật filtering để có thể select một phần dữ liệu trong Dataframe dựa vào nội dung của dữ liệu chứ không chỉ dựa vào index hay label như các bài trước.

# **.where()**

In [134]:
df_using_where = pd.Series([12,34,55,31], index=[1,2,3,4])
df_using_where

1    12
2    34
3    55
4    31
dtype: int64

In [135]:
df_using_where > 50

1    False
2    False
3     True
4    False
dtype: bool

In [138]:
df_using_where[df_using_where > 30]

2    34
3    55
4    31
dtype: int64

In [139]:
df_using_where.where(df_using_where > 44)

1     NaN
2     NaN
3    55.0
4     NaN
dtype: float64

In [141]:
df_using_where_2 = pd.DataFrame(np.random.randn(5, 4) * 100, columns=list('ABCD'))
df_using_where_2

            A          B           C           D
0 -108.588178 -38.932895   71.864562  189.254101
1   36.803881  46.224763  -12.880266   86.603019
2   11.073392 -28.976481 -190.592699  -49.468270
3 -208.167254 -83.847715  124.721221   33.299018
4  190.468771 -26.762846 -178.426231  140.940884

In [142]:
df_using_where_2[df_using_where_2 > 9]

            A          B           C           D
0         NaN        NaN   71.864562  189.254101
1   36.803881  46.224763         NaN   86.603019
2   11.073392        NaN         NaN         NaN
3         NaN        NaN  124.721221   33.299018
4  190.468771        NaN         NaN  140.940884

In [143]:
df_using_where_2.where(df_using_where_2 > 9, -df_using_where_2)

            A          B           C           D
0  108.588178  38.932895   71.864562  189.254101
1   36.803881  46.224763   12.880266   86.603019
2   11.073392  28.976481  190.592699   49.468270
3  208.167254  83.847715  124.721221   33.299018
4  190.468771  26.762846  178.426231  140.940884